<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class NoticesTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('notices')->delete();
        
        \DB::table('notices')->insert(array (
            0 => 
            array (
                'id' => 8,
                'date' => '2023-05-24',
                'title' => 'বেগমগঞ্জ সরকারি টেকনিক্যাল স্কুল ও কলেজের ক্রাফট ইন্সট্রাক্টর জনাব মোঃ শহিদুল ইসলাম এর শ্রান্তি বিনোদনছুটি মঞ্জুরের আদেশ',
                'description' => 'বেগমগঞ্জ সরকারি টেকনিক্যাল স্কুল ও কলেজের ক্রাফট ইন্সট্রাক্টর জনাব মোঃ শহিদুল ইসলাম এর শ্রান্তি বিনোদনছুটি মঞ্জুরের আদেশ',
                'image' => '1152437942.png',
                'deleted_at' => NULL,
                'created_at' => '2023-05-30 05:18:55',
                'updated_at' => '2023-05-30 05:42:19',
            ),
            1 => 
            array (
                'id' => 9,
                'date' => '2023-05-30',
                'title' => 'ফেনী সরকারি টেকনিক্যাল স্কুল ও কলেজের অফিস সহায়ক জনাব মোঃ মোফাক্ষারুল ইসলাম এর শ্রান্তি বিনোদন ভাতা মঞ্জুরের আদেশ',
                'description' => 'ফেনী সরকারি টেকনিক্যাল স্কুল ও কলেজের অফিস সহায়ক জনাব মোঃ মোফাক্ষারুল ইসলাম এর শ্রান্তি বিনোদন ভাতা মঞ্জুরের আদেশ',
                'image' => '746903093.pdf',
                'deleted_at' => NULL,
                'created_at' => '2023-05-30 05:43:08',
                'updated_at' => '2023-06-05 09:13:23',
            ),
            2 => 
            array (
                'id' => 10,
                'date' => '2023-05-23',
                'title' => 'ফেনী সরকারি টেকনিক্যাল স্কুল ও কলেজের অফিস সহায়ক জনাব মোঃ মোফাক্ষারুল ইসলাম এর শ্রান্তি বিনোদন ভাতা মঞ্জুরের আদেশ',
                'description' => 'ফেনী সরকারি টেকনিক্যাল স্কুল ও কলেজের অফিস সহায়ক জনাব মোঃ মোফাক্ষারুল ইসলাম এর শ্রান্তি বিনোদন ভাতা মঞ্জুরের আদেশ',
                'image' => '1878559534.png',
                'deleted_at' => NULL,
                'created_at' => '2023-05-30 05:46:52',
                'updated_at' => '2023-05-30 05:47:54',
            ),
            3 => 
            array (
                'id' => 11,
                'date' => '2023-05-14',
                'title' => 'ব্রাহ্মণবাড়িয়া পলিটেকনিক ইনস্টিটিউটের সুইপার জনাব বিনোদ হরিজন এর শ্রান্তি বিনোদন মঞ্জুর আদেশ',
                'description' => 'ব্রাহ্মণবাড়িয়া পলিটেকনিক ইনস্টিটিউটের সুইপার জনাব বিনোদ হরিজন এর শ্রান্তি বিনোদন মঞ্জুর আদেশ',
                'image' => '580537442.png',
                'deleted_at' => NULL,
                'created_at' => '2023-05-30 09:22:19',
                'updated_at' => '2023-05-30 09:22:19',
            ),
            4 => 
            array (
                'id' => 12,
                'date' => '2023-05-08',
                'title' => 'বান্দরবান টেকনিক্যাল স্কুল ও কলেজের ০২ জন শিক্ষকের ২০২২ সালের বার্ষিক গোপনীয় অনুবেদন ফেরত প্রদান',
                'description' => 'বান্দরবান টেকনিক্যাল স্কুল ও কলেজের ০২ জন শিক্ষকের ২০২২ সালের বার্ষিক গোপনীয় অনুবেদন ফেরত প্রদান',
                'image' => '454589070.png',
                'deleted_at' => NULL,
                'created_at' => '2023-05-30 09:40:47',
                'updated_at' => '2023-05-30 09:40:47',
            ),
            5 => 
            array (
                'id' => 13,
                'date' => '2023-06-06',
                'title' => 'sbit',
                'description' => 'sbit',
                'image' => '738014513.jpg',
                'deleted_at' => '2023-06-10',
                'created_at' => '2023-06-06 09:59:46',
                'updated_at' => '2023-06-10 11:38:35',
            ),
            6 => 
            array (
                'id' => 14,
                'date' => '2023-06-10',
                'title' => 'test',
                'description' => 'test',
                'image' => '611695688.png',
                'deleted_at' => '2023-06-10',
                'created_at' => '2023-06-10 11:25:28',
                'updated_at' => '2023-06-10 11:25:42',
            ),
        ));
        
        
    }
}